Для решения проблем и упрощения написания и запуска тестов существуют специальные фреймворки **test runners** (тест-раннеры). Три основных тестовых фреймворка для Python: *unittest*, *PyTest* и *nose*. Модуль unittest является встроенным инструментом Python; PyTest и nose устанавливаются дополнительно, они позволяют получить расширенные возможности по сравнению с unittest.  
Общее правило для всех фреймворков: название тестового метода должно начинаться со слова "test_".  
Для unittest существуют собственные дополнительные правила:
+ Тесты обязательно должны находиться в специальном тестовом классе.
+ Вместо assert должны использоваться специальные assertion методы.  
